#include "head.h"

// âûâîä ìàññèâà öèëèíäğîâ â òàáëè÷íîì ôîğìàòå, ãîğèçîíòàëüíàÿ ëèíèÿ: — Alt+0151
void showTableCylinder(const char* title, Cylinder* cylinders, int n, int maxIndex)
{
	cout << title
		<< "\t    +—————+—————————————————+————————————————+—————————————————————————————————+\n"
		<< "\t    |  N  |    Ğàäèóñ, R    |    Âûñîòà, H   |   Ïëîùàäü, S   |    Îáúåì, V    |\n"
		<< "\t    +—————+—————————————————+————————————————+—————————————————————————————————+\n";

	// âûâîäèì ñòğîêè òàáëèöû öèëèíäğîâ, ñ âûäåëåíèåì öâåòîì
	// ñòğîêè ñ ìèíèìàëüíûì îáúåìîì, ïåğåä è ïîñëå ıòîé ñòğîêè
	// âûâîäèì öâåòîâûå "õâîñòèêè"
	for (int i = 0; i < n; ++i) {
		cout << "\t";
		setColor(cylinders[i].MathV() == cylinders[maxIndex].MathV() ? acctColor : mainColor);
		cout << "    ";
		cylinders[i].tableRow(i + 1);
		cout << "    ";
		setColor(mainColor);
		cout << "\n";
	} // for i
	cout << "\t    +—————+—————————————————+————————————————+—————————————————————————————————+\n";
} // showTable

// âûâîä ìàññèâà öèëèíäğîâ â òàáëè÷íîì ôîğìàòå, ãîğèçîíòàëüíàÿ ëèíèÿ: — Alt+0151
void showTableConoids(const char* title, Conoid* cylinders, int n, int minIndex)
{
	cout << title
		<< "\t    +—————+—————————————————+————————————————+————————————————+————————————————+————————————————+\n"
		<< "\t    |  N  |    Ğàäèóñ, R    |    Ğàäèóñ, r   |    Âûñîòà, H   |   Ïëîùàäü, S   |    Îáúåì, V    |\n"
		<< "\t    +—————+—————————————————+————————————————+————————————————+————————————————+————————————————+\n";

	// âûâîäèì ñòğîêè òàáëèöû öèëèíäğîâ, ñ âûäåëåíèåì öâåòîì
	// ñòğîêè ñ ìèíèìàëüíûì îáúåìîì, ïåğåä è ïîñëå ıòîé ñòğîêè
	// âûâîäèì öâåòîâûå "õâîñòèêè"
	for (int i = 0; i < n; ++i) {
		cout << "\t";
		setColor(cylinders[i].MathS() == cylinders[minIndex].MathS() ? acctColor : mainColor);
		cout << "    ";
		cylinders[i].tableRow(i + 1);
		cout << "    ";
		setColor(mainColor);
		cout << "\n";
	} // for i
	cout << "\t    +—————+—————————————————+————————————————+————————————————+————————————————+————————————————+\n";
} // showTable