#include "StackPlane.h"

// вывод данных авиакомпании в табличном формате – перегрузка операции вывода <<
ostream& operator<<(ostream& os, StackPlane& stack)
{
	os << "+———————————————+————————————+————————————+————————————————+———————————————————+———————————————————+———————————————————+\n"
		<< "|     Модель    |  Пассажир. | Пассажиров | Расх. горючего |     Стоимость     |  Дальность полёта |  Регистрис. номер |\n"
		<< "|               |    мест    |            |     кг/ч       |      самолёта     |      самолёта     |      самолёта     |\n"
		<< "+———————————————+————————————+————————————+————————————————+———————————————————+———————————————————+———————————————————+\n";

	// если в компании нет самолётов
	if (stack.planes_ == 0)
	{
		os << "|                                                    НЕТ САМОЛЁТОВ                                                     |\n"
			// нижняя строка 
			<< "+———————————————+————————————+————————————+————————————————+———————————————————+———————————————————+———————————————————+\n";
	}

	// вывод самолётов
	for (int i = 0; i < stack.top_; i++)
	{

		os << stack.planes_[i];

		// нижняя строка 
		os << "+———————————————+————————————+————————————+————————————————+———————————————————+———————————————————+———————————————————+\n";
	}

	return os;
}

