#pragma once

#include "pch.h"
#include "Plane.h"
// âûâîä îäíîãî ñàìîë¸òà 
class showOnePlaneTable
{
	Plane plane_;

public:
	explicit showOnePlaneTable() = default;

	explicit showOnePlaneTable(Plane plane) :plane_(plane) {}

	~showOnePlaneTable() = default;

	friend ostream& operator<<(ostream& os, showOnePlaneTable show)
	{
		os << "+———————————————+————————————+————————————+————————————————+———————————————————+———————————————————+———————————————————+\n"
			<< "|     Ìîäåëü    |  Ïàññàæèğ. | Ïàññàæèğîâ | Ğàñõ. ãîğş÷åãî |     Ñòîèìîñòü     |  Äàëüíîñòü ïîë¸òà |  Ğåãèñòğèñ. íîìåğ |\n"
			<< "|               |    ìåñò    |            |     êã/÷       |      ñàìîë¸òà     |      ñàìîë¸òà     |      ñàìîë¸òà     |\n"
			<< "+———————————————+————————————+————————————+————————————————+———————————————————+———————————————————+———————————————————+\n"
			<< show.plane_
			<< "+———————————————+————————————+————————————+————————————————+———————————————————+———————————————————+———————————————————+\n";

		return os;
	}
};
